Repository: scieloorg/pyisis
Catalog: pyisis/pyisis/i18n/pyisis-*.po
Languages: pt_br

source: <h3>@pft must be called after record resource not %s</h3>
pt_br: <h3>@pft deve ser chamada após registro %s</h3>

source: No resource found!
pt_br: Recurso não encontrado!

source: Action range requires at least one parameter.
pt_br: Ação faixa exige pelo menos um parâmetro.

source: Invalid parameter for boolean function.
pt_br: Parâmtro inválido para função booleana.

source: Invalid boolean function named %s
pt_br: Função booleana %s inválida

source: Unexpected type %s
pt_br: Tipo %s inesperado

source: Failed to create collection %s: %s
pt_br: Falha criando coleção %s: %s

source: Unexpected error while processing %s: %s
pt_br: Erro inexperado processando %s: %s

source: Welcome to ISIS-NBP Cell %s Interactive Console
pt_br: Bem-vindo para Console Interativo Célula ISIS-NBP %s

source: Use the console to test and inspect the collections.
pt_br: Use o console para testar e inspecionar as coleções

source: Type 'collection' to see a dictionary with all available collections.
pt_br: Tecle 'collection' para ver um dicionário com todas as coleções disponíveis.

source: Type '<Ctrl-D>' or 'exit()' followed by '<enter>' to quit.
pt_br: Tecle '<Ctrl-D>' or 'exit()' seguido por '<enter>' para sair.

source: The available collections are: %s
pt_br: As coleções disponíveis são: %s

source: Closing ISIS-NBP Interactive Python Console
pt_br: Fechando Console Python Interativo ISIS-NBP

source: ERROR: config file %s with invalid entry: %s.
pt_br: Erro: arquivo de configuração %s com entrada %s inválida %s

source: Expecting <typename>,<path>.
pt_br: Experado <typename>,<path>

source: Expecting True or False.
pt_br: Esperado True ou False.

source: ERROR: config file %s with invalid encoding entry: %s.
pt_br: Erro: arquivo de configuração %s com entrada de encoding inválida: %s.

source: This codec is either not registered or it is spelled incorrectly.
pt_br: Este codec não foi registrado ou está incorreto.

source: Opening file %s for collection %s
pt_br: Abrindo arquivo %s para coleção %s

source: Failed to open %s: %s
pt_br: Falha abrindo %s: %s

source: Collection %s with databases: %s
pt_br: Coleção %s com banco de dados: %s

source: %s is not an attribute of the collection %s
pt_br: %s não é um atributo da coleção %s

source: Empty %s file
pt_br: Arquivo %s vazio

source: %s (next mfn:%s, type:%s) in %s
pt_br: %s (próximo mfn:%s, tipo:%s) em %s

source: Not implemented xrf handling of invalid records.
pt_br: Não implementado manipulação de registros inválidos xrf

source: Asked to undelete record flagged as %s
pt_br: Perguntar para apagar registro marcado como %s

source: Gateway ready to handle HTTP requests at port %s
pt_br: Gateway pronto para tratar requisições HTTP na porta %s

source: Gateway ready to handle SSH requests at port %s
pt_br: Gateway pronto para tratar requisições SSH na porta %s

source: Invalid repeatable literal {%s}
pt_br: Literal com repetição inválida {%s}

source: Invalid conditional literal {%s}
pt_br: Condição literal inválida {%s}

source: Invalid inconditional literal {%s}
pt_br: Literal incondicional inválida {%s}

source: Invalid field expression {%s}
pt_br: Campo de expressão inválida {%s}

source: Value is not recognised as a valid number
pt_br: Valor não reconhecido como número válido

source: Word %s is not recognised as a valid keyword
pt_br: Palavra %s não foi reconhecida como uma plavra-chave

source: Illegal character '%s' at position %d in expression {%s}
pt_br: Caracter ilegal '%s' na posição %d na expressão {%s}

source: Syntax error at '%s'. Type: %s
pt_br: Erro de sintaxe em '%s'. Tipo: %s

source: Syntax error. Empty production.
pt_br: Erro de sintaxe, produção vazia.

source: Tried to save record flagged as invalid.
pt_br: Tentou salvar registro marcado como inválido.

source: Elapsed time:
pt_br: Tempo decorrido:

source: Specify the path to the configuration file
pt_br: Informe o caminho do arquivo de configuração

source: Specify the path to the master file
pt_br: Informe o caminho do arquivo master

source: Specify the path to the output master file
pt_br: Informe o caminho do arquivo master de saída

source: Start in server mode.
pt_br: Iniciar em modo servidor

source: Browse the the master file interactively
pt_br: Inspecionar o arquivo master interativamente

source: List the contents of the master file
pt_br: Lista o conteúdo do arquivo master

source: Profile the execution of --list option
pt_br: Perfil de execução da opção --list

source: Convert master file contents to XML
pt_br: Converte conteúdo arquivo master para XML

source: Interactive mode of operation
pt_br: Modo interativo de operação

source: Prints current version
pt_br: Imprime versão atual

source: Dumps the control record
pt_br: Imprime o registro de controle

source: Copy inputdb into outputdb
pt_br: Copia inputdb em outputdb

source: File %s does not exist or is inaccessible.
pt_br: Arquivo %s não existe ou inacessível.

source: Use -m or --inputdb to set input database.
pt_br: Utilize -m ou --inputdb para marcar banco de dados de entrada.

source: Use -o or --outputdb to set output database.
pt_br: Utilize -o ou --outputdb para marcar banco de dados de saída

source: Error: Can't find the file 'settings.py' in the directory containing %r. It appears you've customized things. You'll have to run django-admin.py, passing it your settings module. (If the file settings.py does indeed exist, it's causing an ImportError somehow.)
pt_br: Erro: Arquivo 'settings.py' não encontrado no diretório %r. Aparentemente você customizou alguns parâmetros. É necessário executar django-admin.py, passando seu módulo de configuração. (Se o arquivo settings.py existe, este está causando um erro de importação.)
